[A_Academy_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_Academy_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_Academy_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_Academy_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_Academy_Fortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_Academy_Fortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_Academy_Fortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_Academy_LightningPyramid H7TownTower]
mName="闪电金字塔"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_Academy_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Academy_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Academy_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Academy_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Academy_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_Academy_FireCave H7TownDwelling]
mName="火焰洞穴"
mDesc="核心单位住所。\n每周可招募15个火精怪。"

[A_Academy_FirePit H7TownDwelling]
mName="熔岩穴"
mDesc="核心单位升级住所。\n可招募并将火精怪升级为炎精怪\n（基础产量：15/周）。"

[A_Academy_LavaPool H7TownGrowthEnhancer]
mName="熔岩池"
mDesc="核心单位升级住所。\n每周火精怪或炎精怪的产量+8。"

[A_Academy_StoneParapet H7TownDwelling]
mName="岩石护栏"
mDesc="核心单位住所。\n每周可招募18个石像怪。"

[A_Academy_SilverParapet H7TownDwelling]
mName="银质护栏"
mDesc="核心单位升级住所。\n可招募并将石像怪升级为黑曜石像怪。\n（基础产量：18/周）"

[A_Academy_CabirFoundry H7TownGrowthEnhancer]
mName="火精怪铸造厂"
mDesc="核心单位升级住所。\n每周石像怪或黑曜石像怪的产量+9。"

[A_Academy_GolemForge H7TownDwelling]
mName="魔像熔炉"
mDesc="核心单位住所。\n每周可招募8个魔像。"

[A_Academy_GolemFoundry H7TownDwelling]
mName="魔像锻造厂"
mDesc="核心单位升级住所。\n可招募并将魔像升级为砂岩魔像\n（基础产量：8/周）。"

[A_Academy_StarsilverFoundry H7TownGrowthEnhancer]
mName="星银锻造厂"
mDesc="核心单位升级住所。\n每周魔像或砂岩魔像的产量+4。"

[A_Academy_SchoolOfMagic H7TownDwelling]
mName="魔法学院"
mDesc="精英单位住所。\n每周可招募5个法师学徒。"

[A_Academy_UniversityOfMagic H7TownDwelling]
mName="魔法大学"
mDesc="精英单位升级住所。\n可招募并将法师学徒升级为法师门徒\n（基础产量：5/周）"

[A_AcademyUniversityOfMagic H7TownDwelling]
mDesc="精英单位升级住所。\n可招募并将法师学徒升级为法师门徒。"

[A_Academy_MageHousings H7TownGrowthEnhancer]
mName="法师住宅"
mDesc="精英单位升级住所。\n每周法师学徒或法师门徒的产量+5。"

[A_Academy_AltarOfWishes H7TownDwelling]
mName="祈愿祭坛"
mDesc="精英单位住所。\n每周可招募4个灯神。"

[A_Academy_PinnacleOfWishes H7TownDwelling]
mName="祈愿尖塔"
mDesc="精英单位升级住所。\n可招募并将灯神升级为通法灯神\n（基础产量：4/周）。"

[A_Academy_WishingWell H7TownGrowthEnhancer]
mName="许愿池"
mDesc="精英单位升级住所。\n每周灯神或通法灯神的产量+4。"

[A_Academy_SilverPavillion H7TownDwelling]
mName="银色阁楼"
mDesc="精英单位住所。\n每周可招募2个罗刹。"

[A_Academy_GoldenPavillion H7TownDwelling]
mName="金色阁楼"
mDesc="精英单位升级住所。\n可招募并将罗刹升级为罗刹侯\n（基础产量：2/周）。"

[A_Academy_RoaringTower H7TownGrowthEnhancer]
mName="呼啸高塔"
mDesc="精英单位升级住所。\n每周罗刹或罗刹侯的产量+2。"

[A_Academy_CloudColiseum H7TownDwelling]
mName="白云斗场"
mDesc="冠军单位住所。\n每周可招募2个巨像。"

[A_Academy_ThundercloudColiseum H7TownDwelling]
mName="雷云斗场"
mDesc="冠军单位升级住所。\n可招募并将巨像升级为泰坦\n（基础产量：2/周）。"

[A_Academy_ArcaneTower H7TownDwelling]
mName="奥术高塔"
mDesc="冠军单位住所。\n每周可招募2个奥术神鹰。"

[A_Academy_ArcaneVortex H7TownDwelling]
mName="奥术漩涡"
mDesc="冠军单位升级住所。\n可招募并将奥术神鹰升级为希摩神鹰。\n（基础产量：2/周）"

[A_Academy_chambre_homme_chacal H7TownDwelling]
mName="沙漠帐篷"
mDesc="精英单位住所。\n可招募阿努基斯。\n可使用"全部招募"功能招募\n（基础产量：4/周）"

[A_Academy_chambre_shantiri H7TownDwelling]
mName="杉提瑞遗迹"
mDesc="冠军单位住所。\n可招募杉提瑞守卫。\n可使用"全部招募"功能招募\n（基础产量：1/周）"

[A_Academy_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_Academy_ArtifactRecycler H7ArtifactRecycler]
mName="宝物回收站"
mDesc="提供将宝物转换为资源的选项。"

[A_Academy_ResourceSilo H7TownSiloBuilding]
mName="物资仓库"
mDesc="每天随机提供1 %icon_Crystal 龙血水晶、%icon_Dragonsteel 龙钢、%icon_Shadowsteel 影钢或%icon_Starsilver 星银。"

[A_Academy_ManaCore H7TownBuilding]
mName="魔能核心"
mDesc="将拜访英雄的最大 %ICON_MANA 法力值翻倍直至周末结束并完全恢复。"

[A_Academy_CastingStage H7TownCastingStage]
mName="施法阶段"
mDesc="使你的英雄能够在此城镇控制区域内的每场战斗开始时对两个随机敌方生物施加两种随机的负面魔法效果。"

[A_Academy_MarketPlace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_Academy_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_Academy_PyramidalCraft H7TownUtilityUnitDwelling]
mName="金字塔作坊"
mDesc="战争单位生产。\n提供购买小型金字塔的选项。"

[A_Academy_AlchemistLab H7TownBuilding]
mName="炼金实验室"
mDesc="每天提供1 %icon_Crystal 龙血水晶。"

[A_Academy_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断，受到随机魔法学派的伤害并失去所有施加的效果。"

[A_Academy_Inscriber H7Inscriber]
mName="卷轴镌刻室"
mDesc="提供购买卷轴的选项。"

[A_Academy_ArcaneLibrary H7TownArcaneLibrary]
mName="奥术图书馆"
mDesc="向魔法行会添加两个1阶和2阶法术以及一个3阶和4阶法术。"

[A_Academy_Workshop H7TownUtilityUnitDwelling]
mName="车间"
mDesc="战争单位生产。\n提供购买治疗帐篷的选项。"

[A_Academy_ArcanePortal H7TownTearOfAsha]
mName="奥术之门"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n所有你的英雄+100最大 %ICON_MANA 法力值。"

[academybuildingabilities.A_Academy_ArcanePortal_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[academybuildingabilities.A_Academy_ArcanePortal_HeroBuff H7BaseBuff]
mName="奥术之门"
mTooltip=""

[academybuildingabilities.A_Academy_ArcanePortal_TownBuff H7BaseBuff]
mName="奥术之门"
mTooltip=""

[academybuildingabilities.A_Academy_CastingStage_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="施法阶段能力"
mTooltip=""

[academybuildingabilities.A_Academy_CastingStage_ApplyDebuff H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="施法阶段"
mTooltip=""

[academybuildingabilities.A_Academy_CastingStage_Buff H7BaseBuff]
mName="施法阶段"
mTooltip="英雄将在下一场战斗开始时对两个随机生物施放两种随机减益效果。"

[academybuildingabilities.A_Academy_ManaCore_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔能核心能力"
mTooltip=""

[academybuildingabilities.A_AcademyManaCore_Ability H7BaseAbility]
mName="魔能核心能力"

[academybuildingabilities.A_AcademyManaCore_Buff H7BaseBuff]
mName="魔能核心"
mTooltip="将拜访英雄的最大 %ICON_MANA 法力值翻倍直至周末结束。"

[academybuildingabilities.A_CastingStage_Ability H7BaseAbility]
mName="施法阶段能力"

[academybuildingabilities.A_CastingStage_Buff H7BaseBuff]
mName="施法阶段"
mTooltip="英雄将在当前控制区域内的战斗开始时对两个随机敌方生物施加两种随机负面魔法效果。"

7.5_mod

新增第8单位槽选项

版本 1.30：

新增替代单位 - 精神元素或精神秘法师，以及它们和罗刹单位的隐藏能力